In [1]:
import numpy as np

In [2]:
import pandas as pd

## Series

In [3]:
my_data = [10,20,30]
labels = ['a','b','c']

In [4]:
# Unlike NumPy arrays, Pandas Series have indexes or labels for every data point
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [5]:
# We can provide our own index for a Series as shown below:
pd.Series(data = my_data, index = labels)

a    10
b    20
c    30
dtype: int64

In [6]:
# We don't have to explicitly mention data and index parameters in Series()
# 1st argument is treated as data and 2nd argument is treated as index by default
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [7]:
# A Series can also be created using NumPy arrays
arr = np.array(my_data)
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [8]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [9]:
# We can also create a Series using Dictionary
d = {'a':10,'b':20,'c':30,'d':40}
pd.Series(d)

a    10
b    20
c    30
d    40
dtype: int64

In [10]:
# Pandas Series can hold a variety of object types as compared to NumPy arrays
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [11]:
pd.Series(data = [sum,len,max]) # Holds reference to these built-in functions as data points

0    <built-in function sum>
1    <built-in function len>
2    <built-in function max>
dtype: object

In [12]:
# Pandas use index names or numbers by allowing for very fast look up of information & works like hash table or dictionary

In [13]:
# It depicts number of COVID-19 cases country wise

ser1 = pd.Series([257000,117000,115000,89000,81000,2300],['USA','Spain','Italy','Germany','China','India'])

In [14]:
ser1

USA        257000
Spain      117000
Italy      115000
Germany     89000
China       81000
India        2300
dtype: int64

In [15]:
# Just like dictionaries, we use indexing to grab any value as shown below:
ser1['India']

2300

In [16]:
s1 = pd.Series([1,2,3,4],['a','b','c','d'])
s2 = pd.Series([5,6,7,8],['a','b','c','e'])

In [17]:
s1 + s2 # On performing any operation, result is converted into float

a     6.0
b     8.0
c    10.0
d     NaN
e     NaN
dtype: float64

## DataFrames

In [18]:
from numpy.random import randn

In [19]:
np.random.seed(101)

In [20]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [21]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
# Each of the columns represent a Pandas Series and they all share common indexes

In [23]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [24]:
type(df['W'])

pandas.core.series.Series

In [25]:
type(df)

pandas.core.frame.DataFrame

In [26]:
df.W # This is also fine

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [27]:
# If you want to access more than 1 column, pass a list of column names as index to dataframe

In [28]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [29]:
# The above output is basically a DataFrame only
type(df[['W','Z']])

pandas.core.frame.DataFrame

In [30]:
# To create a new column in DataFrame, use df[col_name] and assign result of any operation or any object to it
df['new_column'] = df['W'] + df['X'] + df['Y'] + df['Z']

In [31]:
df

          W         X         Y         Z  new_column
A  2.706850  0.628133  0.907969  0.503826    4.746778
B  0.651118 -0.319318 -0.848077  0.605965    0.089688
C -2.018168  0.740122  0.528813 -0.589001   -1.338233
D  0.188695 -0.758872 -0.933237  0.955057   -0.548357
E  0.190794  1.978757  2.605967  0.683509    5.459028

In [32]:
df['new_column'] = [1,2,3,4,5]

In [33]:
df

          W         X         Y         Z  new_column
A  2.706850  0.628133  0.907969  0.503826           1
B  0.651118 -0.319318 -0.848077  0.605965           2
C -2.018168  0.740122  0.528813 -0.589001           3
D  0.188695 -0.758872 -0.933237  0.955057           4
E  0.190794  1.978757  2.605967  0.683509           5

In [34]:
# To drop a column from DataFrame, use drop() method.
# The below line won't run because by default axis=0 which stands for row. So, we've to specify axis=1 argument

#### df.drop('new_column')

In [35]:
df.drop('new_column',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [36]:
# If you check df, the column is still there as it's not dropped permanently
df

          W         X         Y         Z  new_column
A  2.706850  0.628133  0.907969  0.503826           1
B  0.651118 -0.319318 -0.848077  0.605965           2
C -2.018168  0.740122  0.528813 -0.589001           3
D  0.188695 -0.758872 -0.933237  0.955057           4
E  0.190794  1.978757  2.605967  0.683509           5

In [37]:
# To drop column permanently, use inplace=True
df.drop('new_column',axis=1,inplace=True)

In [38]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [39]:
# To drop a row, use drop(). Axis isn't required as axis=0 by default
df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [40]:
df.shape

(5, 4)

In [41]:
type(df.shape)

tuple

In [42]:
# As given by shape, the size of df is 5 X 4. 
# The return type of shape is tuple. So, axis=0 stands for rows and axis=1 for columns

In [43]:
# To select a row from DataFrame, we can use the following:

In [44]:
df.loc['A'] # It denotes that not only columns but rows are also a Series in DataFrame

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [45]:
# We can also access rows using index location as shown below:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [46]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [47]:
# To get any particluar value, use df.loc[row,column] notation like we do in NumPy arrays

In [48]:
df.loc['A','Z']

0.5038257538223936

In [49]:
# To get subset of DataFrame, use df.loc[[list_of_rows],[list_of_columns]]

In [50]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

#### Conditional Selection in DataFrames

In [51]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [52]:
bool_df = df > 0

In [53]:
bool_df

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [54]:
# It returns only those elements which satisfy the condition df > 0, for rest of them it gives NaN
df[df > 0] # Same as df[bool_df]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [55]:
df['X'] > 0 # It returns a boolean series

A     True
B    False
C     True
D    False
E     True
Name: X, dtype: bool

In [56]:
df[df['X'] > 0] # Returns rows for which the column X > 0

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [57]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [58]:
df[df['Z'] < 0] # Returns rows for which column Z < 0

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [59]:
df[df['W'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [60]:
# To grab only column Y from the above DF, we write like:
df[df['W'] > 0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [61]:
# To grab columns X and Z from above DF, we can provide list of columns after DF as:
df[df['W'] > 0][['X','Z']]

          X         Z
A  0.628133  0.503826
B -0.319318  0.605965
D -0.758872  0.955057
E  1.978757  0.683509

In [62]:
# To get above output in multiple steps, we write like:
bool_series = df['W'] > 0
result = df[bool_series]
my_cols = ['X','Z']
result[my_cols]

          X         Z
A  0.628133  0.503826
B -0.319318  0.605965
D -0.758872  0.955057
E  1.978757  0.683509

In [63]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [64]:
# Now, to apply 2 or more conditions, we can use & or |

In [65]:
df[(df['W'] > 0) & (df['Y'] > 1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [66]:
df[(df['X'] < 0) | (df['Z'] < 0)]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [67]:
# NOTE: We can't use "and" or "or" opeartors above because these can't take into account a Series of boolean values.
# These can handle only single boolean values.

#### Reset the Index

In [68]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [69]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [70]:
new_col = 'HR PB UK HP JK'.split()

In [71]:
new_col

['HR', 'PB', 'UK', 'HP', 'JK']

In [72]:
df['State'] = new_col

In [73]:
df

          W         X         Y         Z State
A  2.706850  0.628133  0.907969  0.503826    HR
B  0.651118 -0.319318 -0.848077  0.605965    PB
C -2.018168  0.740122  0.528813 -0.589001    UK
D  0.188695 -0.758872 -0.933237  0.955057    HP
E  0.190794  1.978757  2.605967  0.683509    JK

In [74]:
# To make an existing column as index, use set_index()
df.set_index('State')

              W         X         Y         Z
State
HR     2.706850  0.628133  0.907969  0.503826
PB     0.651118 -0.319318 -0.848077  0.605965
UK    -2.018168  0.740122  0.528813 -0.589001
HP     0.188695 -0.758872 -0.933237  0.955057
JK     0.190794  1.978757  2.605967  0.683509

In [75]:
df # set and reset index are not in place

          W         X         Y         Z State
A  2.706850  0.628133  0.907969  0.503826    HR
B  0.651118 -0.319318 -0.848077  0.605965    PB
C -2.018168  0.740122  0.528813 -0.589001    UK
D  0.188695 -0.758872 -0.933237  0.955057    HP
E  0.190794  1.978757  2.605967  0.683509    JK

#### Multi-Index in DataFrames

In [76]:
#Index Levels
outer = ['G1','G1','G1','G2','G2','G2']
inner = [1,2,3,1,2,3]
hier_index = list(zip(outer,inner))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [77]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [78]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [79]:
# Let's see how to access multi-index DataFrame

In [80]:
df.loc['G1'] # It's a sub-dataframe

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [81]:
df.loc['G1'].loc[3] # It's a series

A   -0.134841
B    0.390528
Name: 3, dtype: float64

In [82]:
df.index.names

FrozenList([None, None])

In [83]:
df.index.names = ['Groups','RowNum']

In [84]:
df

                      A         B
Groups RowNum
G1     1       0.302665  1.693723
       2      -1.706086 -1.159119
       3      -0.134841  0.390528
G2     1       0.166905  0.184502
       2       0.807706  0.072960
       3       0.638787  0.329646

In [85]:
df.index.names

FrozenList(['Groups', 'RowNum'])

In [86]:
df.loc['G2'].loc[2]['B']

0.07295967531703869

In [87]:
# To access the values of columns corresponding to rowNum 1 in Groups G1 and G2, we use the following:
df.xs(1,level='RowNum')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

### Missing Data

In [88]:
my_dict = {'A':[1,2,np.nan], 'B':[4,np.nan,np.nan], 'C':[7,8,9]}

In [89]:
my_df = pd.DataFrame(my_dict)

In [90]:
my_df

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [91]:
# To drop the rows which have NaN, use dropna() method
my_df.dropna()

     A    B  C
0  1.0  4.0  7

In [92]:
# To drop the columns which have NaN, use dropna() method with argument axis=1
my_df.dropna(axis=1)

   C
0  7
1  8
2  9

In [93]:
# To keep rows having NaN values, we can specify argument 'thresh' to any int value. 
# It means rows with that many non-NaN values will be kept and rows having less than that will be dropped.

my_df.dropna(thresh=2)

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8

In [94]:
# Filling Missing Values

In [95]:
my_df.fillna(value='X')

   A  B  C
0  1  4  7
1  2  X  8
2  X  X  9

In [96]:
my_df.fillna(value=my_df.mean()) # Fill missing values with the mean of values in their corresponding columns

     A    B  C
0  1.0  4.0  7
1  2.0  4.0  8
2  1.5  4.0  9

In [97]:
my_df['A'].fillna(my_df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

### Groupby

In [98]:
companies_data = {'Company':['Google','Google','Microsoft','Microsoft','Facebook','Facebook'],
                 'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
                 'Sales':[200,120,340,124,243,350]}

In [99]:
company_df = pd.DataFrame(companies_data)

In [100]:
company_df

     Company   Person  Sales
0     Google      Sam    200
1     Google  Charlie    120
2  Microsoft      Amy    340
3  Microsoft  Vanessa    124
4   Facebook     Carl    243
5   Facebook    Sarah    350

In [101]:
# By default, Pandas ignore non-numeric column 'Person' & takes mean of 'Sales' column if we don't specify any column name
company_df.groupby('Company').mean()

           Sales
Company
Facebook   296.5
Google     160.0
Microsoft  232.0

In [102]:
# Similarly, we can do sum like:
company_df.groupby('Company').sum()

           Sales
Company
Facebook     593
Google       320
Microsoft    464

In [103]:
ms_sales = company_df.groupby('Company').sum().loc['Microsoft']

In [104]:
ms_sales

Sales    464
Name: Microsoft, dtype: int64

In [105]:
type(ms_sales)

pandas.core.series.Series

In [106]:
# Count
company_df.groupby('Company').count()

           Person  Sales
Company
Facebook        2      2
Google          2      2
Microsoft       2      2

In [107]:
# Max
company_df.groupby('Company').max()

            Person  Sales
Company
Facebook     Sarah    350
Google         Sam    200
Microsoft  Vanessa    340

In [108]:
# Min
company_df.groupby('Company').min()

            Person  Sales
Company
Facebook      Carl    243
Google     Charlie    120
Microsoft      Amy    124

In [109]:
# Describe
company_df.groupby('Company').describe()

          Sales
          count   mean         std    min     25%    50%     75%    max
Company
Facebook    2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
Google      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
Microsoft   2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [110]:
company_df.groupby('Company').describe().transpose()

Company        Facebook      Google   Microsoft
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [111]:
company_df.groupby('Company').describe().loc['Facebook']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: Facebook, dtype: float64

### Merging, Joining and Concatenating DataFrames

In [112]:
# Let's look at concatenation of dataframes first:

Concatenation basically glues together DataFrames. 
Remember that dimensions should match along the axis you are concatenating on.

In [113]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']},
                  index = [0,1,2,3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [114]:
df2 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']},
                  index = [4,5,6,7])
df2

    A   B   C   D
4  A0  B0  C0  D0
5  A1  B1  C1  D1
6  A2  B2  C2  D2
7  A3  B3  C3  D3

In [115]:
df3 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']},
                  index = [8,9,10,11])
df3

     A   B   C   D
8   A0  B0  C0  D0
9   A1  B1  C1  D1
10  A2  B2  C2  D2
11  A3  B3  C3  D3

In [116]:
# All the 3 dataframes above have same columns i.e., A, B, C & D but different indexes. 
# Now, let's concatenate these 3 dataframes together.

In [117]:
pd.concat([df1,df2,df3]) # axis=0 by default

     A   B   C   D
0   A0  B0  C0  D0
1   A1  B1  C1  D1
2   A2  B2  C2  D2
3   A3  B3  C3  D3
4   A0  B0  C0  D0
5   A1  B1  C1  D1
6   A2  B2  C2  D2
7   A3  B3  C3  D3
8   A0  B0  C0  D0
9   A1  B1  C1  D1
10  A2  B2  C2  D2
11  A3  B3  C3  D3

In [118]:
# So, all 3 dataframes above are concatenated row wise.

In [119]:
# We can also change the order of concatenation like this:
pd.concat([df3,df1,df2])

     A   B   C   D
8   A0  B0  C0  D0
9   A1  B1  C1  D1
10  A2  B2  C2  D2
11  A3  B3  C3  D3
0   A0  B0  C0  D0
1   A1  B1  C1  D1
2   A2  B2  C2  D2
3   A3  B3  C3  D3
4   A0  B0  C0  D0
5   A1  B1  C1  D1
6   A2  B2  C2  D2
7   A3  B3  C3  D3

In [120]:
# Now, let's concatnate the 3 DataFrames column wise
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A0   B0   C0   D0  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A1   B1   C1   D1  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A2   B2   C2   D2  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A3   B3   C3   D3  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A0   B0   C0   D0
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A1   B1   C1   D1
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A2   B2   C2   D2
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A3   B3   C3   D3

Since, in df1, the columns A, B, C & D don't have any value for indexes beyond 3, they are filled with NaN and 
same applies for other DataFrames also.

In [121]:
# Let's look at Merging DataFrames now:

In [122]:
left = pd.DataFrame({'A':['A0','A1','A2'],
                    'B':['B0','B1','B2'],
                    'key':['K0','K1','K2']})
left

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2

In [123]:
right = pd.DataFrame({'C':['C0','C1','C2'],
                      'D':['D0','D1','D2'],
                    'key':['K0','K1','K2']})
right

    C   D key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2

Merge functions allows you to merge DataFrames together using similar logic as merging SQL tables together. For example:

In [124]:
pd.merge(left,right,how='inner',on='key') # Here, argument 'how' denotes type of join and 'on' denotes column to join on.

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2

In [125]:
d1 = pd.DataFrame({'key1':['K0','K0','K1','K2'],
                    'key2':['K0','K1','K0','K1'],
                    'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3']})
d1

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [126]:
d2 = pd.DataFrame({'key1':['K0','K1','K1','K2'],
                    'key2':['K0','K0','K0','K0'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']})
d2

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

Now, we are merging DataFrames based on key1 and key2. It means rows in d1 having a pair of values for key1 & key2
are matched with rows in d2 having same pair of values for key1 & key2 and then they are merged in result DataFrame.

In [127]:
#Inner Join
pd.merge(d1,d2,on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [128]:
# Full Outer Join
pd.merge(d1,d2,how='outer',on=['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [129]:
# Left Outer Join
pd.merge(d1,d2,how='left',on=['key1','key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [130]:
# Right Outer Join
pd.merge(d1,d2,how='right',on=['key1','key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [131]:
# Let's look at Joining of DataFrames now

Joining is used for combining the columns of two potentially different-indexed DataFrames into a single resultant DataFrame

In [132]:
j1 = pd.DataFrame({'A':['A0','A1','A2'],
                  'B':['B0','B1','B2']},
                  index = ['K0','K1','K2'])
j1

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [133]:
j2 = pd.DataFrame({'C':['C0','C1','C2'],
                  'D':['D0','D1','D2']},
                  index = ['K0','K2','K3'])
j2

     C   D
K0  C0  D0
K2  C1  D1
K3  C2  D2

In [134]:
j1.join(j2) # By default, it's Left Outer Join

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C1   D1

In [135]:
j1.join(j2,how='outer') # Full Outer Join

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C1   D1
K3  NaN  NaN   C2   D2

### Operations on DataFrames

In [136]:
z = pd.DataFrame({'col1':[1,2,3,4],
                 'col2':[444,555,666,444],
                 'col3':['varun','manika','divya','vivek']})
z

   col1  col2    col3
0     1   444   varun
1     2   555  manika
2     3   666   divya
3     4   444   vivek

In [137]:
# To find unique values in a column, use unique() method

z['col2'].unique()

array([444, 555, 666], dtype=int64)

In [138]:
# To find the number of unique values in a column, use nunique() method

z['col2'].nunique()

3

In [139]:
# To count how many times a value has occured in a column, use value_counts() method. 
# It's similar to grouping and taking count.

z['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [140]:
# If you want to apply any user-defined method on any column of DF, use apply() method as pass tht function as argument

In [141]:
def double(x):
    return x * 2

In [142]:
z

   col1  col2    col3
0     1   444   varun
1     2   555  manika
2     3   666   divya
3     4   444   vivek

In [143]:
z['col1'].apply(double)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [144]:
z['col3'].apply(len)

0    5
1    6
2    5
3    5
Name: col3, dtype: int64

In [145]:
# We can write our function directly in apply() method as lambda expresion and apply it to a column

In [178]:
z['col3']=z['col3'].apply(lambda x: x.capitalize())

In [179]:
z

   col1  col2    col3
0     1   444   Varun
1     2   555  Manika
2     3   666   Divya
3     4   444   Vivek

In [147]:
z.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [148]:
z.index

RangeIndex(start=0, stop=4, step=1)

In [149]:
# Sorting

In [150]:
z.sort_values(by='col2')

   col1  col2    col3
0     1   444   varun
3     4   444   vivek
1     2   555  manika
2     3   666   divya

In [181]:
# To find nulls, se isnull() method
z.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [152]:
# Pivot Table

In [153]:
p = pd.DataFrame({'A':['foo','foo','foo','bar','bar','bar'],
                 'B':['one','one','two','two','one','one'],
                 'C':['x','y','x','y','x','y'],
                 'D':[1,3,2,5,4,1]})
p

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [154]:
p.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

## Data Input and Output

1. CSV
2. Excel
3. HTML
4. SQL

Let's look at reading CSV files first

In [155]:
example = pd.read_csv('example.csv')

In [156]:
example

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [183]:
example.loc[1]

a    4
b    5
c    6
d    7
Name: 1, dtype: int64

In [157]:
# To save a DataFrame as CSV file, use to_csv() function.

In [158]:
example.to_csv('my_output') # By default, index is saved as a column using argument index=True

In [159]:
pd.read_csv('my_output')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [160]:
# If you don't want to save index as column, use index=False as the argument in to_csv() function.

In [161]:
example.to_csv('my_output',index=False)

In [162]:
pd.read_csv('my_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

Now, let's look at reading Excel files

In [163]:
# Pandas can read only data. It can't read images, formulas or macros.

In [164]:
excel_df = pd.read_excel('excel_sample.xlsx',sheet_name='Sheet1')

In [165]:
excel_df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [166]:
# To save a DataFrame as Excel file, use to_excel() function.

In [167]:
excel_df.to_excel('excel_output.xlsx',sheet_name='MySheet')

Let's now look at reading data from a HTML page or a webpage

In [168]:
banks = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [169]:
# It reads the data as a list
type(banks)

list

In [170]:
# The very first item in that list is our DataFrame. Basically, it checks for <table> in HTML source and reads that as DF
banks[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
...,...,...,...,...,...,...
556,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
557,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
558,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
559,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
560,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [171]:
banks[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"

 *Now, let's look at reading SQL data in Pandas*

In [172]:
from sqlalchemy import create_engine

In [173]:
sql_engine = create_engine('sqlite:///:memory:')

In [174]:
excel_df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [175]:
excel_df.to_sql('my_table',sql_engine)

In [176]:
sql_df = pd.read_sql('my_table',con=sql_engine)

In [177]:
sql_df

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15